# print(type('hello World'))
# # print(type("Hello","world","hong"))

# # type( ) 타입확인
# print(type(2893))
# print(type(232.1321))

# # 2 연산자 -제곱 연산자
# print("2**1=", 2**1)
# print("2**2=", 2**2)
# print("2**3=", 2**3)
# print("2**4=", 2**4)
# print("2**5=", 2**5)

# # 연산자
# print("2+3=", 2+3)
# print("2-4=", 2-4)
# print("2/5=", 2/5)
# print("2*3=", 2*3)

# # 정수 나누기 연산
# print("3/2=", 3/2)

# # 정수 소수점 내림 처리
# print("3//2=", 3//2)

# 3 문자열 처리 [idx]
# print("안녕하세요")
# # 왼쪽에서 오른쪽
# print("안녕하세요"[0])
# print("안녕하세요"[1])
# print("안녕하세요"[2])
# print("안녕하세요"[3])
# print("안녕하세요"[4])
# print()
# # 오른쪽에서 왼쪽
# print("안녕하세요"[-1])
# print("안녕하세요"[-2])
# print("안녕하세요"[-3])
# print("안녕하세요"[-4])
# print("안녕하세요"[-5])

#문자열 처리 - 문자열 자르기( 슬라이싱 )
print("안녕하세요"[0:3])
print("안녕하세요"[1:2])
print("안녕하세요"[2:4])
print("안녕하세요"[1:3])
print()
# [시작 인덱스 : 끝 인덱스 ]
print("안녕하세요"[2:-1])

# 문자열 길이
print(len("안녕하세요"))